/*Пользователь вводит текущий час (от 0 до 23). Если час от 5 до 11 — «Доброе утро», 
от 12 до 17 — «Добрый день», от 18 до 22 — «Добрый вечер», иначе — «Доброй ночи».
*/
#include <stdio.h>

int main() {
	int hour;
	printf("Введите час (0-23): ");
	scanf("%d", &hour);
	
	if (hour >= 5 && hour <= 11) {
		printf("Доброе утро\n");
	} else if (hour >= 12 && hour <= 17) {
		printf("Добрый день\n");
	} else if (hour >= 18 && hour <= 22) {
		printf("Добрый вечер\n");
	} else {
		printf("Доброй ночи\n");
	}
	
	return 0;
}
