//Введите балл от 0 до 100. Выведите оценку: 90–100 — «отлично», 75–89 — «хорошо», 60–74 — «удовлетворительно», меньше 60 — «неудовлетворительно». Выполнил: Мартиросян Сергей группа 201ИС-25
#include <stdio.h>
int main (void) {
    int ball;
    printf ("Введите баллы:");
    scanf ("%d", &ball);
    if (ball >= 90 && ball <= 100 ) {
        printf ("Отлично\n");
    }
    else if (ball >= 75 && ball <= 89) {
        printf ("Хорошо\n");
    }
    else if  (ball >= 60 && ball <= 74) {
        printf ("удовлетворительно\n");
    }
    else {
        printf ("неудовлетворительно\n");
    }
    return 0;
}
